#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlterationOptionsIngredientsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AlterationOptionsIngredientsList.AlterationOptionsIngredientsList_C
// 0x0038 (0x02F0 - 0x02B8)
class UAlterationOptionsIngredientsList_C final  : public UFortItemQuantityListBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAlterationOptionsIngredientsListEntry_C* AlterationOptionsIngredientsListEntry;             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlterationOptionsIngredientsListEntry_C* AlterationOptionsIngredientsListEntry_1;           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlterationOptionsIngredientsListEntry_C* AlterationOptionsIngredientsListEntry_2;           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FreeText;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         IngredientsBox;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetupTitle(bool Temp_bool_Variable, bool CallFunc_IsEmptyList_ReturnValue, class UWidget* K2Node_Select_Default);
	void AddListEntry(class UFortItemQuantityListEntryBase* ListEntry);
	void Construct();
	void ExecuteUbergraph_AlterationOptionsIngredientsList(int32 EntryPoint, const struct FMargin& K2Node_MakeStruct_Margin, class UFortItemQuantityListEntryBase* K2Node_Event_ListEntry, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlterationOptionsIngredientsList_C">();
	}
	static class UAlterationOptionsIngredientsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlterationOptionsIngredientsList_C>();
	}
};

}

