#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SkyDiveContrailPreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SkyDiveContrailPreviewDisplay.B_SkyDiveContrailPreviewDisplay_C
// 0x0048 (0x0298 - 0x0250)
class AB_SkyDiveContrailPreviewDisplay_C final  : public AFortSkyDiveContrailPreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DiveAnimation;                                     // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityZ;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C82[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystem*>                OverrideParticleGroup;                             // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DiveSpeed_VelocityY;                               // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetDive_VelocityY;                              // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetGlide_VelocityY;                             // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_SkyDiveContrailPreviewDisplay(int32 EntryPoint, float CallFunc_Abs_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue_1, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, float CallFunc_Multiply_FloatFloat_ReturnValue, class UAnimMontage* Temp_object_Variable, class UAnimMontage* Temp_object_Variable_1, bool Temp_bool_Variable, float CallFunc_Multiply_FloatFloat_ReturnValue_1, bool CallFunc_GetGender_IsMale, bool CallFunc_GetGender_IsFemale, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class UAnimMontage* K2Node_Select_Default, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UFrontendAnimInstance* K2Node_DynamicCast_AsFrontend_Anim_Instance, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue_1, float CallFunc_Montage_Play_ReturnValue, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue_1, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena_1, bool K2Node_DynamicCast_bSuccess_2, float CallFunc_Multiply_FloatFloat_ReturnValue_3, const struct FVector& CallFunc_MakeVector_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_4, class UAthenaSkyDiveContrailItemDefinition* K2Node_Event_Contrail, class UObject* Temp_object_Variable_2, class UParticleSystem* K2Node_DynamicCast_AsParticle_System, bool K2Node_DynamicCast_bSuccess_3, class UParticleSystem* CallFunc_FrontEndVersionChange_OutputPar, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_3, float K2Node_Event_DeltaSeconds, float CallFunc_MapRangeClamped_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_4, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, float CallFunc_GetCurveValue_ReturnValue, bool Temp_bool_B_Execution_Happened_Variable, float CallFunc_MapRangeClamped_ReturnValue_3, bool Temp_bool_A_Execution_Happened_Variable, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_5, class UObject* K2Node_CustomEvent_Loaded, const struct FVector& CallFunc_MakeVector_ReturnValue_6, float CallFunc_MapRangeClamped_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue_7, float CallFunc_MapRangeClamped_ReturnValue_5, const struct FVector& CallFunc_MakeVector_ReturnValue_8, float CallFunc_MapRangeClamped_ReturnValue_6, const struct FVector& CallFunc_MakeVector_ReturnValue_9);
	void ReceiveTick(float DeltaSeconds);
	void PreviewContrail(class UAthenaSkyDiveContrailItemDefinition* Contrail);
	void OnLoaded_CDC8E6A542897483A7F4BF856D2198B5(class UObject* Loaded);
	void FrontEndVersionChange(class UParticleSystem* InputPar, class UParticleSystem** OutputPar, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UParticleSystem* CallFunc_Array_Get_Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SkyDiveContrailPreviewDisplay_C">();
	}
	static class AB_SkyDiveContrailPreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SkyDiveContrailPreviewDisplay_C>();
	}
};

}

