#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurrentReportStackingEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CurrentReportStackingEntry.CurrentReportStackingEntry_C
// 0x0070 (0x02A0 - 0x0230)
class UCurrentReportStackingEntry_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Type;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Value;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerReportingStep                          DisplayedStep;                                     // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599B[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextValue;                                         // 0x0258(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReportedPlayerDisplayCategoryText;                 // 0x0270(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReportingReasonDisplayCategoryText;                // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetDisplayTextFields(EPlayerReportingStep Temp_byte_Variable, class FText Temp_text_Variable, class FText CallFunc_TextToUpper_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, class FText K2Node_Select_Default);
	void Construct();
	void InitStackingEntryFields(EPlayerReportingStep DisplayedReportingStep, class FText DisplayText);
	void ExecuteUbergraph_CurrentReportStackingEntry(int32 EntryPoint, EPlayerReportingStep K2Node_CustomEvent_DisplayedReportingStep, class FText K2Node_CustomEvent_DisplayText, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurrentReportStackingEntry_C">();
	}
	static class UCurrentReportStackingEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurrentReportStackingEntry_C>();
	}
};

}

