#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Perk_H_FeelTheBASE_DeathListener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_GenericTriggeredAbility_Perk_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Perk_H_FeelTheBASE_DeathListener.GA_Perk_H_FeelTheBASE_DeathListener_C
// 0x0040 (0x0AC0 - 0x0A80)
class UGA_Perk_H_FeelTheBASE_DeathListener_C final  : public UGAT_GenericTriggeredAbility_Perk_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Perk_H_FeelTheBASE_DeathListener_C; // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_Overflow;                                       // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 StackCount;                                        // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack1;                                            // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack2;                                            // 0x0AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack3;                                            // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Perk_H_FeelTheBASE_DeathListener(int32 EntryPoint, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, const struct FGameplayEffectContextHandle& CallFunc_GetGrantedByEffectContext_ReturnValue, struct FGameplayEventData& K2Node_Event_EventData, class AActor* CallFunc_EffectContextGetInstigatorActor_ReturnValue, class AB_Perk_C_Constructor_BASE_C* K2Node_DynamicCast_AsB_Perk_C_Constructor_BASE, bool K2Node_DynamicCast_bSuccess, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FGameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActor_ReturnValue, int32 CallFunc_GetGameplayEffectCount_ReturnValue, TArray<struct FActiveGameplayEffectHandle>& CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue, bool CallFunc_ExecuteGC_Overflow);
	void ExecuteGC(class AB_Perk_C_Constructor_BASE_C* BaseReference, bool* Overflow, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput, bool CallFunc_HasAllMatchingGameplayTags_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector_NetQuantize10& K2Node_MakeStruct_Vector_NetQuantize10, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue);
	void ActivateBaseStacks(int32 Stack_Count, class AB_Perk_C_Constructor_BASE_C* BaseReference, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& Param_EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Perk_H_FeelTheBASE_DeathListener_C">();
	}
	static class UGA_Perk_H_FeelTheBASE_DeathListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Perk_H_FeelTheBASE_DeathListener_C>();
	}
};

}

