#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusicManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MusicManager.MusicManager_C
// 0x0108 (0x03A8 - 0x02A0)
class AMusicManager_C final  : public AFortMusicManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Boss_Music_B;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Boss_Weak_Point_Stinger;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Boss_DBNO_Music;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Boss_Music_A;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Gameplay_Music_Fader_Volume_9439D7624B6E99ADF50793B4628A7615; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Gameplay_Music_Fader__Direction_9439D7624B6E99ADF50793B4628A7615; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A00[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Gameplay_Music_Fader;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MusicFrontend;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MusicLobby;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StingerReturningToAmbientMusic;                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A01[0x3];                                     // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GameMode_Current;                                  // 0x02F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameMode_Lobby;                                    // 0x02FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameMode_Frontend;                                 // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GameMode_InGame;                                   // 0x030C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayStingerWhenReturningToAmbientMusic;            // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingAmbientMusic;                               // 0x0315(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingThreatMusic;                                // 0x0316(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingNearbyEnemiesMusic;                         // 0x0317(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingHuskLowMusic;                               // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingHuskHighMusic;                              // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingLargeEnemyMusic;                            // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A02[0x1];                                     // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastTimeMusicWasStartedOrContinued;                // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentMusicIntensityLevel;                        // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A03[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MusicLogicUpdateTickTime;                          // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDurationBeforeMusicCanIncreaseIntensity;        // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityIncreaseFadeTime;                         // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicFadeStyles                              IntensityIncreaseFadeStyle;                        // 0x0334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A04[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinDurationBeforeMusicCanDecreaseInIntensity;      // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityDecreaseFadeTime;                         // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicFadeStyles                              IntensityDecreaseFadeStyle;                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MusicShouldStop;                                   // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayingStingerMusic;                               // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A05[0x1];                                     // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntensityVeryHigh;                                 // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityHigh;                                     // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityMedium;                                   // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityLow;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A06[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMusicAsset*                        DeathMusic;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Countdown_Music_;                                  // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A07[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Coundown_Atlas_Music;                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Mission_Music;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Boss_Fight;                                     // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A08[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Weak_Point_Music;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Current_Boss_Music;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCombatThresholds                         Combat_Threshold;                                  // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A09[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Player_Downed_Timer_Handle;                        // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortMusicAsset*                        Current_TOD;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MusicManager(int32 EntryPoint, float CallFunc_GetGameTimeInSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue, TDelegate<void(class UFortMusicVoice* Voice)> K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Has_Been_Initd_Variable, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue_1, bool CallFunc_NotEqual_IntInt_ReturnValue_2, float CallFunc_GetGameTimeInSeconds_ReturnValue_2, float CallFunc_GetGameTimeInSeconds_ReturnValue_3, float CallFunc_Subtract_FloatFloat_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class AFortPlayerPawn* CallFunc_GetPlayerPawn_ReturnValue, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsDead_ReturnValue, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_2, float Temp_float_Variable, bool Temp_bool_IsClosed_Variable, class USoundBase* K2Node_CustomEvent_Sound_3, class USoundBase* K2Node_CustomEvent_Sound_2, bool Temp_bool_Has_Been_Initd_Variable_1, float Temp_float_Variable_1, float CallFunc_GetGameTimeInSeconds_ReturnValue_4, class USoundBase* K2Node_CustomEvent_Sound_1, float CallFunc_Subtract_FloatFloat_ReturnValue_2, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue_2, bool CallFunc_NotEqual_ObjectObject_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue_5, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_3, class UFortMusicAsset* CallFunc_GetAssetFromDayPhase_ReturnValue, bool Temp_bool_IsClosed_Variable_1, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, EFortDayPhase K2Node_Event_CurrentDayPhase, EFortDayPhase K2Node_Event_PreviousDayPhase, bool K2Node_Event_bAtCreation, bool Temp_bool_Variable, float Temp_float_Variable_2, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, float Temp_float_Variable_3, bool Temp_bool_Variable_3, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_EqualEqual_NameName_ReturnValue, bool Temp_bool_Variable_4, bool CallFunc_EqualEqual_NameName_ReturnValue_1, float CallFunc_GetWorldDeltaSeconds_ReturnValue, float Temp_float_Variable_4, float CallFunc_GetWorldDeltaSeconds_ReturnValue_1, float CallFunc_GetWorldDeltaSeconds_ReturnValue_2, float Temp_float_Variable_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue_3, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_4, bool Temp_bool_Has_Been_Initd_Variable_2, class UFortMusicAsset* CallFunc_GetAssetFromDayPhase_ReturnValue_1, float CallFunc_GetWorldDeltaSeconds_ReturnValue_3, class UFortMusicAsset* K2Node_Event_NewMusicAsset, class UFortMusicVoice* CallFunc_PlayMusicVoice_ReturnValue, float K2Node_CustomEvent_Time_1, float K2Node_CustomEvent_Time, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, class UFortMusicVoice* K2Node_CustomEvent_Voice, bool Temp_bool_Variable_5, float Temp_float_Variable_6, bool Temp_bool_IsClosed_Variable_2, float Temp_float_Variable_7, float CallFunc_GetGameTimeInSeconds_ReturnValue_6, class UFortMusicManagerBank* K2Node_Event_NewBank, bool CallFunc_EqualEqual_NameName_ReturnValue_2, bool CallFunc_EqualEqual_NameName_ReturnValue_3, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_1, struct FFortPlayerDeathReport& K2Node_Event_DeathReport, bool Temp_bool_Has_Been_Initd_Variable_3, float K2Node_CustomEvent_Counter, bool CallFunc_LessEqual_FloatFloat_ReturnValue, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_4, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_5, class USoundBase* K2Node_CustomEvent_Sound, class UAudioComponent* K2Node_CustomEvent_Mission_Music, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue_2, bool Temp_bool_Variable_6, bool CallFunc_EqualEqual_NameName_ReturnValue_5, EFortCombatThresholds K2Node_Event_OldThreshold, EFortCombatThresholds K2Node_Event_NewThreshold, bool Temp_bool_IsClosed_Variable_3, float CallFunc_GetGameTimeInSeconds_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class AFortPlayerPawn* CallFunc_GetPlayerPawn_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_6, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_EqualEqual_NameName_ReturnValue_7, uint8 CallFunc_MakeLiteralByte_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_3, int32 CallFunc_MakeLiteralInt_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue, class UFortMusicAsset* CallFunc_GetAssetFromCombatIntensity_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_2, uint8 CallFunc_MakeLiteralByte_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_MakeLiteralInt_ReturnValue_1, class UFortMusicAsset* CallFunc_GetAssetFromCombatIntensity_ReturnValue_1, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue_6, class UFortMusicAsset* CallFunc_GetAssetFromDayPhase_ReturnValue_2, bool CallFunc_NotEqual_ObjectObject_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_4, float CallFunc_GetEventHeatPercent_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_Greater_FloatFloat_ReturnValue_4, float CallFunc_GetEventHeatPercent_ReturnValue_1, float CallFunc_GetEventHeatPercent_ReturnValue_2, bool CallFunc_Greater_FloatFloat_ReturnValue_5, bool CallFunc_Greater_FloatFloat_ReturnValue_6, float CallFunc_GetEventHeatPercent_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_Greater_FloatFloat_ReturnValue_7, uint8 CallFunc_MakeLiteralByte_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, float CallFunc_Conv_BoolToFloat_ReturnValue, int32 CallFunc_MakeLiteralInt_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_2, float K2Node_Select_Default, bool CallFunc_BooleanAND_ReturnValue_4, float CallFunc_FInterpTo_ReturnValue, class UFortMusicAsset* CallFunc_GetAssetFromCombatIntensity_ReturnValue_2, float CallFunc_GetEventHeatPercent_ReturnValue_4, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_4, bool CallFunc_Greater_FloatFloat_ReturnValue_8, float CallFunc_GetEventHeatPercent_ReturnValue_5, float CallFunc_GetEventHeatPercent_ReturnValue_6, bool CallFunc_Greater_FloatFloat_ReturnValue_9, float CallFunc_GetEventHeatPercent_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_6, float CallFunc_GetEventHeatPercent_ReturnValue_8, float CallFunc_Conv_BoolToFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_3, bool CallFunc_Less_FloatFloat_ReturnValue_1, int32 CallFunc_MakeLiteralInt_ReturnValue_3, float K2Node_Select_Default_1, bool CallFunc_Greater_IntInt_ReturnValue_3, float CallFunc_FInterpTo_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_5, class UFortMusicAsset* CallFunc_GetAssetFromCombatIntensity_ReturnValue_3, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_5, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue_6, float CallFunc_GetEventHeatPercent_ReturnValue_9, float CallFunc_GetEventHeatPercent_ReturnValue_10, float CallFunc_GetEventHeatPercent_ReturnValue_11, float CallFunc_GetEventHeatPercent_ReturnValue_12, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_GetEventHeatPercent_ReturnValue_13, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_4, bool CallFunc_Less_FloatFloat_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue_3, float K2Node_Select_Default_2, float K2Node_Select_Default_3, float CallFunc_FInterpTo_ReturnValue_2, float CallFunc_FInterpTo_ReturnValue_3);
	void Spawn_from_being_down();
	void OnPlayerSpawned();
	void OnThresholdChange(EFortCombatThresholds OldThreshold, EFortCombatThresholds NewThreshold);
	void Stop_Mission_Music(class UAudioComponent* Param_Mission_Music);
	void Play_Mission_Music(class USoundBase* Sound);
	void Play_Countdown_Music(float Counter);
	void OnPlayerDowned(struct FFortPlayerDeathReport& DeathReport);
	void OnMusicBankChanged(class UFortMusicManagerBank* NewBank);
	void Gather_Combat_Graph_Tresholds();
	void On_Stinger_Completed(class UFortMusicVoice* Voice);
	void Music_Fade_Out(float Time);
	void Music_Fade_In(float Time);
	void PlayStinger(class UFortMusicAsset* NewMusicAsset);
	void On_Music_Tick();
	void ReceiveBeginPlay();
	void PlayAmbientMusic();
	void OnUpdateMusic();
	void OnDayPhaseChanged(EFortDayPhase Param_CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void Stop_Weakpoint_Music();
	void Start_Weak_Point_Music(class USoundBase* Sound);
	void Player_Fighting_Boss_DBNO();
	void Stop_Boss_DBNO_Music();
	void Start_Boss_DBNO_Music(class USoundBase* Sound);
	void Play_Boss_Music(class USoundBase* Sound);
	void Stop_Boss_Music();
	void Gameplay_Music_Fader__UpdateFunc();
	void Gameplay_Music_Fader__FinishedFunc();
	void UserConstructionScript(class AFortPlayerControllerFrontEnd* K2Node_DynamicCast_AsFort_Player_Controller_Front_End, bool K2Node_DynamicCast_bSuccess, class AFortPlayerControllerFrontEnd* K2Node_DynamicCast_AsFort_Player_Controller_Front_End_1, bool K2Node_DynamicCast_bSuccess_1);
	void ResetMusicBools();
	void Primary_Music_Threshold_(EFortMusicCombatIntensity Intensity, bool bPlayStinger, class UFortMusicManagerBank* CallFunc_GetMusicBank_ReturnValue, class UFortMusicAsset* CallFunc_GetAssetFromCombatIntensity_ReturnValue, class UFortMusicVoice* CallFunc_ChangePrimaryMusic_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MusicManager_C">();
	}
	static class AMusicManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMusicManager_C>();
	}
};

}

