#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupItemListComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PickupItemListComponent.PickupItemListComponent_C
// 0x0068 (0x0140 - 0x00D8)
class UPickupItemListComponent_C final  : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AFortPickupAthena*>              ItemsToBeAddedQueue;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UFortWorldItemDefinition*>       ItemList;                                          // 0x00F0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, RepNotify)
	struct FTimerHandle                           AddItemsTimerHandle;                               // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AddItemsTimeout;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6951[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMinigameSpawnerSpawnParams>    ItemsToSpawn;                                      // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame)
	UMulticastInlineDelegateProperty_             OnItemAdded;                                       // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastInlineDelegateProperty_             OnItemListUpdated;                                 // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnItemAdded__DelegateSignature(class AActor* ItemAdded);
	void OnItemListUpdated__DelegateSignature();
	void ExecuteUbergraph_PickupItemListComponent(int32 EntryPoint, class AFortVolume* K2Node_Event_VolumeSpawnedWithin);
	void PreSaveBaseActorRecord();
	void PreFinishSpawning(class AFortVolume* VolumeSpawnedWithin);
	void PostLevelSaveSpawnCleanup();
	void PostFinishSpawning();
	void AddItemToQueue(class AFortPickupAthena* NewItem, bool* bItemAdded, bool bSuccess, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class AFortPawn* CallFunc_GetPawnWhoDroppedPickup_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_CanInteractWithOwner_bCanInteract, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void CanInteractWithOwner(class AFortPawn* InteractingPawn, bool* bCanInteract, class AFortMinigame* CurrentMinigame, class AFortVolume* CurrentVolume, bool bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class AFortMinigame* CallFunc_GetMinigameForVolume_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_2, class AFortVolume* CallFunc_CanPlayerCreateInCurrentVolume_OutCurrentVolume, bool CallFunc_CanPlayerCreateInCurrentVolume_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_HasStarted_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void AddItemsToList(const TArray<class UFortWorldItemDefinition*>& NewItemList, class AFortPickupAthena* CurrentPickup, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_GetItemEntryNum_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue, class AFortPickupAthena* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Variable, struct FFortItemEntry& CallFunc_GetItemEntry_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, class UFortWorldItemDefinition* K2Node_DynamicCast_AsFort_World_Item_Definition, bool K2Node_DynamicCast_bSuccess, TSoftObjectPtr<class UFortWorldItemDefinition> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct FMinigameSpawnerSpawnParams& K2Node_MakeStruct_MinigameSpawnerSpawnParams, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void IsItemInList(class UFortWorldItemDefinition* ItemDefinition, bool* bInList, bool bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void ClearItemList();
	void OnRep_ItemList();
	void IsItemInQueue(class AFortPickupAthena* NewItem, bool* bInQueue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);

	bool CanBeSavedToCreativeVolume() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickupItemListComponent_C">();
	}
	static class UPickupItemListComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickupItemListComponent_C>();
	}
};

}

