#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tree_Palm_C

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Parent_Tree_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tree_Palm_C.Tree_Palm_C_C
// 0x0020 (0x0CB0 - 0x0C90)
class ATree_Palm_C_C final  : public AParent_Tree_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Tree_Palm_C_C;                      // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasBugs;                                           // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6C55[0x3];                                     // 0x0C99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UseLightningBug;                                   // 0x0C9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                BugOffset;                                         // 0x0CA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tree_Palm_C(int32 EntryPoint, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, const struct FHitResult& CallFunc_K2_AddRelativeLocation_SweepHitResult);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tree_Palm_C_C">();
	}
	static class ATree_Palm_C_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATree_Palm_C_C>();
	}
};

}

